#### SetTargetElementIds Method

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

Sets the set of ElementIds to test from in intersection testing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetTargetElementIds( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetTargetElementIds ( _ 	elementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetTargetElementIds( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The target ElementIds.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ReferenceIntersector Class

Autodesk.Revit.DB Namespace